## Renaming Pandas columns

### Paulo Cysne Rios Jr | Oct 23, 2017

In [15]:
import pandas as pd

In [16]:
cars = pd.DataFrame({"Models": ["Chevy", "Toyota Corola", 
                                "Honda Civic"],
                    "Units": [987, 234, 129],
                    "Year": [2012, 2016, 2010]})

In [17]:
cars

          Models  Units  Year
0          Chevy    987  2012
1  Toyota Corola    234  2016
2    Honda Civic    129  2010

In [18]:
cars.columns

Index(['Models', 'Units', 'Year'], dtype='object')

#### Renaming all columns

In [19]:
cars.columns = ["Model", "Model Units", "Year"]

In [20]:
cars

           Model  Model Units  Year
0          Chevy          987  2012
1  Toyota Corola          234  2016
2    Honda Civic          129  2010

#### Renaming just one column

In [21]:
cars.rename(columns = {"Year": "Year Made"}, inplace = True)

In [22]:
cars

           Model  Model Units  Year Made
0          Chevy          987       2012
1  Toyota Corola          234       2016
2    Honda Civic          129       2010

In [23]:
cars2 = cars.rename(columns = {"Year Made": "Model Year"}, 
            inplace = False)

In [24]:
cars

           Model  Model Units  Year Made
0          Chevy          987       2012
1  Toyota Corola          234       2016
2    Honda Civic          129       2010

In [25]:
cars2

           Model  Model Units  Model Year
0          Chevy          987        2012
1  Toyota Corola          234        2016
2    Honda Civic          129        2010

## Using set_index

In [28]:
cars.set_index("Model", inplace = True)

In [29]:
cars

               Model Units  Year Made
Model
Chevy                  987       2012
Toyota Corola          234       2016
Honda Civic            129       2010